
////////////////////////////ابلاغ بيطري////////////////////////

final Map<String, List<String>> diseaseCategories = {
  "الأمراض الناتجة عن لدغات الحشرات": [
    "الحمى النزفية",
    "الدودة القلبية",
    "الجرب",
    "غير متأكد"
  ],
  "الأمراض البكتيرية": [
    "التسمم الغذائي",
    "الإصابات والجروح",
    "الأمراض الجلدية",
    "غير متأكد"
  ],
  "الأمراض الفيروسية": [
    "الحمى القلاعية",
    "الجدري",
    "التهاب الفم الحويصلي",
    "غير متأكد"
  ],
  "الإصابات والجروح": [
    "الجروح المفتوحة",
    "الخراجات",
    "تورم الأنسجة",
    "غير متأكد"
  ],
  "الأمراض الجلدية": [
    "الطفح الجلدي",
    "القوباء الحلقية",
    "التهابات الجلد",
    "غير متأكد"
  ],
  "الأمراض الطفيلية": [
    "الدودة الكبدية",
    "الديدان المعوية",
    "القراد",
    "غير متأكد"
  ],
  "الأمراض التنفسية": ["التهاب الرئة", "نقص المناعة التنفسية"],
  "التورمات والأورام": ["التورم الناتج عن العدوى", "تورم المفاصل", "غير متأكد"],
};

final List<String> questions = [
  "الحيوان بياكل طبيعي؟",
  "الحيوان بيشرب مياه كفاية؟",
  "الحيوان بيتحرك زي ما تعودت عليه؟",
  "بيتنفس طبيعي؟",
  "الإخراج منتظم؟",
  "فيه تساقط شعر أو بقع على الجلد؟",
  "الحيوان كان تعرض لنفس الأعراض دي قبل كده؟",
  "الحيوان خد تطعيماته كاملة؟",
  "فيه أي تغيير في مكان الحيوان، أو أكله مؤخرًا؟",
];

////////////////////////////الطقس////////////////////////

Map<String, String> weatherCondition = {
  'Clear': 'صافي',
  'Partially cloudy': 'غائم جزئيا',
  'Overcast': 'غائم كليا',
  'Fog': 'ضباب',
  'Mist': 'شبورة مائية',
  'Dust': 'غبار',
  'Sand': 'رمال متحركه',
  'Sandstorm': 'عاصفة رملية',
  'Duststorm': 'عاصفة ترابية',
  'Rain': 'امطار',
  'Heavy Rain': 'امطار غزيرة',
  'Light Rain': 'امطار خفيفة',
  'Drizzle': 'رذاذ',
  'Thunderstorm': 'عاصفة رعدية',
  'Windy': 'رياح قوية',
  'Cold': 'بارد',
  'Hot': 'ساخن',
  'Freezing': 'تجمد',
};




